#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access will be created
  + resource "aws_eks_access_entry" "access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "restaurant-34-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "master",
          + "worker",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::035133178716:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.policy will be created
  + resource "aws_eks_access_policy_association" "policy" {
      + associated_at = (known after apply)
      + cluster_name  = "restaurant-34-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::035133178716:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.restaurant-34-cluster will be created
  + resource "aws_eks_cluster" "restaurant-34-cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "restaurant-34-cluster"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::035133178716:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-014bc2699ecc62036",
              + "subnet-04c6fa2fc05244f17",
              + "subnet-067e697220cab5c08",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "restaurant-34-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
          + "t3a.large",
          + "m5.large",
          + "m5a.large",
          + "m4.large",
        ]
      + node_group_name        = "restaurant-34"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::035133178716:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-014bc2699ecc62036",
          + "subnet-04c6fa2fc05244f17",
          + "subnet-067e697220cab5c08",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + remote_access {
          + ec2_ssh_key               = "teste"
          + source_security_group_ids = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group.allow_sonar will be created
  + resource "aws_security_group" "allow_sonar" {
      + arn                    = (known after apply)
      + description            = "Allow Sonar connection"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow_sonar"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_ssh"
        }
      + tags_all               = {
          + "Name" = "allow_ssh"
        }
      + vpc_id                 = "vpc-01762e4150e03a675"
    }

  # aws_security_group.allow_ssh will be created
  + resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow ssh connection"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_ssh"
        }
      + tags_all               = {
          + "Name" = "allow_ssh"
        }
      + vpc_id                 = "vpc-01762e4150e03a675"
    }

  # aws_vpc_security_group_ingress_rule.allow_sonar_ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_sonar_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "172.31.0.0/16"
      + from_port              = 9000
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 9000
    }

  # aws_vpc_security_group_ingress_rule.allow_ssh_ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_ssh_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "172.31.0.0/16"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "ssh"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 0
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ySodias, Action: `pull_request`*